Llerr/Clock-on-STM32/Core/Src/Screen/ScreensDescriptions.c
/*
 * ScreensDescriptions.c
 *
 *  Created on: 11 сент. 2021 г.
 *      Author: lex
 */

#include <Arial_7x10.h>
#include <buttons.h>
#include <Font_5x8.h>
#include <stddef.h>
#include <stm32_ub_font.h>
#include <Screen/Screens.h>
#include <Screen/ScreensDescriptions.h>
#include <Screen/ScreensDrawing.h>

ScreenDescript *screenCur = NULL;
ScreenDescript *screenPrev = NULL;

char *weekText[]=
{
    "    Sunday ",
    "    Monday ",
    "  Tuesday ",
    "Wednesday",
    "  Thursday",
    "    Friday ",
    "   Saturday",
};


//Понедельник - Monday - Mon или Mo
//Вторник - Tuesday - Tue или Tu
//Среда - Wednesday - Wed или We
//Четверг - Thursday - Thu или Th
//Пятница - Friday - Fri или Fr
//Суббота - Saturday - Sat или Sa
//Воскресенье - Sunday - Sun или Su


char *menuText[] =
{
    "Time        ",
    "Date        ",
    "Alarms >    ",
    "Brightness >"
};



//----------------------------------------------------------------------------------------------------------------------
//---------------------------------- Данные ----------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//                                     1+13*2
TextSets textBlinkTime =   {txtTime,       27,     -5,  WHITE,  BLACK, &pDigital_7_28, drawBlink,        ":"}; // Двоеточие для мигания

TextSets textHour        = {txtTime,        1,     -5,  WHITE,  BLACK, &pDigital_7_28, drawHour,         NULL}; // Время
TextSets textMinute      = {txtTime,        27+4,  -5,  WHITE,  BLACK, &pDigital_7_28, drawMinute,       NULL}; // Время
TextSets textBellOn      = {txtTime,        57,    1,   WHITE,  BLACK, &pDigital_7_28, drawBellOn,       NULL}; // Время
TextSets textDateAdd     = {txtDate,        0,     19,  YELLOW, BLACK, &pArial_13,     drawDateAdd,      NULL}; // Дата дополнительным полем
TextSets textTemperature = {txtTemperature, 0,     19,  YELLOW, BLACK, &pArial_13,     drawTemperature,  NULL}; // температура
TextSets textHumidity    = {txtHumidity,    0,     19,  YELLOW, BLACK, &pArial_13,     drawHumidity,     NULL}; // Влажность
TextSets textPressure    = {txtPressure,    0,     19,  YELLOW, BLACK, &pArial_13,     drawPressure,     NULL}; // Давление
TextSets textClock       = {txtClock,       18,    19,  YELLOW, BLACK, &pArial_13,     drawClock,        NULL}; // Будильник
TextSets textSleep       = {txtSleep,       20,    19,  YELLOW, BLACK, &pArial_13,     drawSleep,        NULL}; // Досыпание

TextSets textDate        = {txtTimer,       0,     0,  WHITE, BLACK, &pTimes_18,     drawDate,         NULL}; // Дата
TextSets textWeekDay     = {txtTimer,       1,    18, YELLOW, BLACK, &pArial_13,     drawWeekDay,      NULL}; // День недели

TextSets textAlarm            = {txtTime,        0,       -5, WHITE,  BLACK, &pDigital_7_28, drawAlarm,         NULL}; // Время
TextSets textAlarmDays        = {txtAlarmDays,   0,       23, YELLOW, BLACK, &Arial_7x10,    drawAlarmDays,     NULL}; // Список дней недели
TextSets textAlarmOffDays     = {txtAlarmDays,   0+7*5,   23, YELLOW, BLACK, &Arial_7x10,    drawAlarmOffDays,  NULL}; // Список дней недели
TextSets textAlarmOn          = {txtAlarmDays,   0+7*7+1, 23, YELLOW, BLACK, &Arial_7x10,    drawAlarmOn,       NULL}; // Список дней недели
TextSets textAlarmDaysEdit    = {txtAlarmDays,   0,       23, YELLOW, BLACK, &Arial_7x10,    drawEdit,          editTextDays}; // Список дней недели для редактирования
TextSets textAlarmOffDaysEdit = {txtAlarmDays,   0,       23, YELLOW, BLACK, &Arial_7x10,    drawEdit,          editTextOffDays}; // Список дней недели для редактирования
TextSets textAlarmOnEdit      = {txtAlarmDays,   0,       23, YELLOW, BLACK, &Arial_7x10,    drawEdit,          editTextAlarmOn}; // Список дней недели для редактирования
TextSets textBlinkDays        = {txtAlarmDays,   0,       23, GREEN,  BLACK, &Arial_7x10,    drawBlink,         blinkText}; // Рабочий день недели, для мигания
TextSets textBlinkOffDays     = {txtAlarmDays,   0+7*5,   23, RED,    BLACK, &Arial_7x10,    drawBlink,         blinkText}; // Выходной день недели, для мигания
TextSets textBlinkAlarmOn     = {txtAlarmDays,   0+7*7+1, 23, WHITE,  BLACK, &Arial_7x10,    drawBlink,         blinkText}; // Одиночный будильник, для мигания

TextSets textTimer       = {txtTimer,       0,     0, YELLOW, BLACK, &pComic_16,     drawTimer,        NULL};
TextSets textCountDown   = {txtCountdown,   0,     0, YELLOW, BLACK, &pTimes_18,     drawCountdown,    NULL};
TextSets textBrightness  = {txtBrightness, 16,     0, YELLOW, BLACK, &pTimes_18,     drawBrightness,   NULL}; // Яркость экрана
TextSets textIllum       = {txtIllum,      16,    16,    RED, BLACK, &pComic_16,     drawIllumination, NULL}; // Внешняя освещённость

TextSets textPomidoroWork    = {txtPomidoroWork,  0,     0, GREEN,  BLACK, &pTimes_18,     drawPomidoro,     NULL}; // Текст со временем помидора
TextSets textPomidoroRest    = {txtPomidoroRest,  0,     0,   RED,  BLACK, &pTimes_18,     drawPomidoro,     NULL}; // Текст со временем помидора
TextSets textPomidoroInfo    = {txtPomidoroInfo,  0,    16, WHITE,  BLACK, &pTimes_18,     drawPomidoroInfo, NULL}; // Текст со временем помидора

TextSets textCntDownInf     = {txtCountdownInfo,   2, 19,    WHITE, BLACK, &pArial_13,     drawText,    "Countdown"}; // Пояснительная надпись
TextSets textCntDownFinish  = {txtCountdownFinish, 2, 17,      RED, BLACK, &pTimes_18,     drawBlink32,    "FINISH"}; // надпись о завершении отсчёта

/// Пункты меню, выделенные и нет.
TextSets textMenuTime        = {txtMenu,    0, 0,  GREEN, BLACK,       &pArial_13, drawMenu, "Time       "};
TextSets textMenuTimeSel     = {txtMenuSel, 0, 0,  WHITE, BLACK,       &pArial_13, drawMenu, "Time       "};
TextSets textMenuDate        = {txtMenu,    0, 11, GREEN, BLACK,       &pArial_13, drawMenu, "Date       "};
TextSets textMenuDateSel     = {txtMenuSel, 0, 11, WHITE, BLACK,       &pArial_13, drawMenu, "Date       "};
TextSets textMenuAlr         = {txtMenu,    0, 22, GREEN, BLACK,       &pArial_13, drawMenu, "Alarms >   "};
TextSets textMenuAlrSel      = {txtMenuSel, 0, 22, WHITE, BLACK,       &pArial_13, drawMenu, "Alarms >   "};
TextSets textMenuBright      = {txtMenu,    0, 0,  GREEN, BLACK,       &pArial_13, drawMenu, "Brightness "};
TextSets textMenuBrightSel   = {txtMenuSel, 0, 0,  WHITE, BLACK,       &pArial_13, drawMenu, "Brightness "};
TextSets textMenuPomidoro    = {txtMenu,    0, 0,  GREEN, BLACK,       &pArial_13, drawMenu, "Pomidoro>  "};
TextSets textMenuPomidoroSel = {txtMenuSel, 0, 0,  WHITE, BLACK,       &pArial_13, drawMenu, "Pomidoro>  "};
TextSets textMenuDebug       = {txtMenu,    0, 11, GREEN, TRANSPARENT, &pArial_13, drawMenu, "Debug >  "};
TextSets textMenuDebugSel    = {txtMenuSel, 0, 11, WHITE, TRANSPARENT, &pArial_13, drawMenu, "Debug >  "};

