Llerr/Clock-on-STM32/Core/Src/Screen/ScreensDescriptions.c
TextSets textMenuPomWork         = {txtMenu,    0, 0,  GREEN, BLACK,       &pArial_13, drawMenu, "Time work  "};
TextSets textMenuPomWorkSel      = {txtMenuSel, 0, 0,  WHITE, BLACK,       &pArial_13, drawMenu, "Time work  "};
TextSets textMenuPomSmallRest    = {txtMenu,    0, 0,  GREEN, BLACK,       &pArial_13, drawMenu, "Small Rest "};
TextSets textMenuPomSmallRestSel = {txtMenuSel, 0, 0,  WHITE, BLACK,       &pArial_13, drawMenu, "Small Rest "};
TextSets textMenuPomBigRest      = {txtMenu,    0, 0,  GREEN, BLACK,       &pArial_13, drawMenu, "Big rest   "};
TextSets textMenuPomBigRestSel   = {txtMenuSel, 0, 0,  WHITE, BLACK,       &pArial_13, drawMenu, "Big rest   "};
TextSets textMenuPomNum          = {txtMenu,    0, 0,  GREEN, BLACK,       &pArial_13, drawMenu, "Day`s amounts"}; // amount
TextSets textMenuPomNumSel       = {txtMenuSel, 0, 0,  WHITE, BLACK,       &pArial_13, drawMenu, "Day`s amounts"};
TextSets textMenuPomSeries       = {txtMenu,    0, 0,  GREEN, BLACK,       &pArial_13, drawMenu, "Num in series"};
TextSets textMenuPomSeriesSel    = {txtMenuSel, 0, 0,  WHITE, BLACK,       &pArial_13, drawMenu, "Num in series"};

TextSets textDebugAHT10    = {txtAHT10, 0, 0,   WHITE, BLACK, &Font_5x8, drawAHT10, "AHT10"};

TextSets textDebugBMP280   = {txtBMP280, 0, 0,   WHITE, BLACK, &Font_5x8, drawBMP280, "BMP280"};

//TextSets textMenuAlrm0    = {txtMenu,    0, 0,  GREEN, BLACK, &pArial_13, drawMenu, "Alarm 1     "};
//TextSets textMenuAlrm0Sel = {txtMenuSel, 0, 0,  WHITE, BLACK, &pArial_13, drawMenu, "Alarm 1     "};
//TextSets textMenuAlrm1    = {txtMenu,    0, 11, GREEN, BLACK, &pArial_13, drawMenu, "Alarm 2     "};
//TextSets textMenuAlrm1Sel = {txtMenuSel, 0, 11, WHITE, BLACK, &pArial_13, drawMenu, "Alarm 2     "};
//TextSets textMenuAlrm2    = {txtMenu,    0, 22, GREEN, BLACK, &pArial_13, drawMenu, "Alarm 3     "};
//TextSets textMenuAlrm2Sel = {txtMenuSel, 0, 22, WHITE, BLACK, &pArial_13, drawMenu, "Alarm 3     "};


TextSets textTimeEdit      = {txtTimeEdit, 1, -5, WHITE,  BLACK, &pDigital_7_28, drawEdit,  editText};  // Текст для редактирования
TextSets textBlinkTimeEdit = {txtTimeEdit, 1, -5, WHITE,  BLACK, &pDigital_7_28, drawBlink, blinkText}; // Время

TextSets textEditBright32   = {txtEditBright32,  16, 0,  YELLOW, BLACK, &pTimes_18, drawEdit32,    editText};
TextSets textEdit32         = {txtEdit32,         0, 0,  YELLOW, BLACK, &pTimes_18, drawEdit32,    editText};
TextSets textBlink32        = {txtBlink32,        0, 0,  YELLOW, BLACK, &pTimes_18, drawBlink32,   blinkText};


//TextSets *texts = {textTime, textTemperature};
//----------------------------------------------------------------------------------------------------------------------
//-------------------- Э К Р А Н Ы -------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenClock =
{
    stateClock,
    &textBlinkTime, //blink
    0,               //автосброс режима

    &screenClock, // Лево
    &screenClock, // Право
    &screenClock,
    &screenClock,
    &screenClock,

    &screenClock, // кнопка set

    sleepOn,      // Краткое нажатие
    alarmOff,     // Длинное нажатие
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    3,
    {&textHour, &textMinute, &textClock}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenSleep =
{
    stateSleep,
    &textBlinkTime, //blink
    0,               //автосброс режима

    &screenSleep, // Лево
    &screenSleep, // Право
    &screenSleep,
    &screenSleep,
    &screenSleep,

    &screenSleep, // кнопка set

    midStub,      // Краткое нажатие
    alarmOff,     // Длинное нажатие
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    3,
    {&textHour, &textMinute, &textSleep}
};


//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMain1 =
{
    stateTime,
    &textBlinkTime,
    0,               //автосброс режима

    &screenMain2,      // следующий экран режима
    &screenMain4,
    &screenDate,
    &screenBrightness,
    &screenMain1,

    &screenMenuTime, // кнопка set

    midStub,      // Краткое нажатие
    selectMenuTime,
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textHour, &textMinute, &textTemperature, &textBellOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMain2 =
{
    stateTime,
    &textBlinkTime, //blink
    0,               //автосброс режима

    &screenMain3,    // следующий экран режима
    &screenMain1,
    &screenDate,
    &screenBrightness,
    &screenMain2,

    &screenMenuTime, // кнопка set

    midStub,      // Краткое нажатие
    selectMenuTime,     // Длинное нажатие
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textHour, &textMinute, &textHumidity, &textBellOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMain3 =
{
    stateTime,
    &textBlinkTime, //Текст для мигания
    0,               //автосброс режима

    &screenMain4,    // следующий экран режима
    &screenMain2,
    &screenDate,
    &screenBrightness,
    &screenMain3,

    &screenMenuTime, // кнопка set

    midStub,      // Краткое нажатие
    selectMenuTime,     // Длинное нажатие
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textHour, &textMinute, &textPressure, &textBellOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMain4 =
{
    stateTime,
    &textBlinkTime, //blink
    0,               //автосброс режима

//    &screenClock, // Лево
    &screenMain1,       // следующий экран режима  (Лево)
    &screenMain3,       // предыдущий экран режима (Право)
    &screenDate,        // следующий режим         (вверх)
    &screenBrightness,  // предыдущий режим        (вниз)
    &screenMain4,

    &screenMenuTime, // кнопка set

