Llerr/Clock-on-STM32/Core/Src/Screen/ScreensDescriptions.c
    midStub,      // Краткое нажатие
    selectMenuTime,     // Длинное нажатие
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textHour, &textMinute, &textDateAdd, &textBellOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenBrightness =
{
    stateBrightness,
    NULL, //blink
    1,               //автосброс режима

    &screenBrightness,  // следующий экран режима
    &screenBrightness,  // предыдущий экран режима
    &screenMain1,       // следующий режим
    &screenCountdown,   // предыдущий режим
    &screenMain1,       // режим, при долгом нажатии влево. (выход из меню, из редактирования)

    &screenMenuTime, // кнопка set

    midStub,            // Краткое нажатие средней кнопки
    inBrightness,       // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    2,
    {&textBrightness, &textIllum}
};

//----------------------------------------screenCountdown------------------------------------------------------------------------------
ScreenDescript screenCountdown =
{
    stateCountDown,
    NULL, //blink
    1,               //автосброс режима

    &screenCountdown,   // следующий экран режима
    &screenCountdown,   // предыдущий экран режима
    &screenBrightness,  // следующий режим
    &screenPomidoro,    // предыдущий режим
    &screenMain1,

    &screenMenuTime, // кнопка set

    countdownStartStop,   // Краткое нажатие средней кнопки
    inCountdownEdit,              // Длинное нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    2,
    {&textCountDown, &textCntDownInf}
};

//----------------------------------------screenPomidoro------------------------------------------------------------------------------
ScreenDescript screenPomidoro =
{
    statePomidoro,
    NULL, //blink
    1,               //автосброс режима

    &screenPomidoro,    // следующий экран режима
    &screenPomidoro,    // предыдущий экран режима
    &screenCountdown,  // следующий режим
    &screenDate,        // предыдущий режим
    &screenMain1,       // режим, при долгом нажатии влево. (выход из меню, из редактирования)

    &screenMenuTime,    // кнопка set

    pomidoroStartStop,  // Краткое нажатие средней кнопки
    pomidoroReset,      // Длинное нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    2,
    {&textPomidoroRest, &textPomidoroInfo}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenDate =
{
    stateDate,
    NULL, //blink
    1,               //автосброс режима

    &screenDate,       // следующий экран режима
    &screenDate,       // предыдущий экран режима
    &screenPomidoro,   // следующий режим
    &screenMain1,      // предыдущий режим
    &screenMain1,

    &screenMenuTime,   // кнопка set

    midStub,           // Краткое нажатие средней кнопки
    selectMenuDate,           // Длинное нажатие средней кнопки

    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    2,
    {&textDate, &textWeekDay}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenCountdownFinish =
{
    stateCountDownFinish,
    &textCntDownFinish, //blink
    0,               //автосброс режима

    &screenCountdownFinish,   // следующий экран режима
    &screenCountdown,   // предыдущий экран режима
    &screenCountdown,   // следующий режим
    &screenCountdown,   // предыдущий режим
    &screenMain1,

    &screenMenuTime, // кнопка set

    countdownFinish,   // Краткое нажатие средней кнопки
    inCountdownEdit,              // Длинное нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    1,
    {&textCountDown}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenCountdownEdit =
{
    stateCountDownEdit,
    &textBlink32, //blink
    0,               //автосброс режима

    &screenCountdownEdit,  // следующий экран режима
    &screenCountdownEdit,  // предыдущий экран режима
    &screenCountdownEdit,  // следующий режим
    &screenCountdownEdit,  // предыдущий режим
    &screenMain1,

    &screenCountdownEdit, // кнопка set

    saveCountdown,               // Краткое нажатие средней кнопки
    midStub,                     // Длинное нажатие средней кнопки
    buttonReceiverCountdownEdit, // Обработчик кнопок в этом пункте
    2,
    {&textEdit32, &textCntDownInf}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenBrightnessEdit =
{
    stateBrightnessEdit,
    &textBlink32, //blink
    0,               //автосброс режима

    &screenBrightnessEdit,    // следующий экран режима
    &screenBrightnessEdit,    // предыдущий экран режима
    &screenBrightnessEdit,    // следующий режим
    &screenBrightnessEdit,    // предыдущий режим
    &screenBrightness,        // режим, при долгом нажатии влево. (выход из меню, из редактирования)

    &screenBrightnessEdit, // кнопка set (В режиме редактирования не используется)

    saveBrightness,           // Краткое нажатие средней кнопки
    showMenu,                 // Долгое нажатие средней кнопки
    buttonReceiverBrightEdit, // Обработчик кнопок в этом пункте
    2,
    {&textEditBright32, &textIllum}
};

//----------------------------------------------------------------------------------------------------------------------
//---------------------------- M E N U ---------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuTime =
{
    stateMenuTime,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuTime,  // Право
    &screenMain1,  // Лево
    &screenMenuTime,  // вверх
    &screenMenuDate,  // вниз
    &screenMain1,  // Долгое нажатие влево

