Llerr/Clock-on-STM32/Core/Src/Screen/ScreensDescriptions.c
    &screenMain1, // кнопка set

    selectMenuTime,      // Краткое нажатие центр
    midStub,             // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    3,
    {&textMenuTimeSel, &textMenuDate, &textMenuAlr}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuDate =
{
    stateMenuDate,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuDate,  // Право
    &screenMenuDate,  // Лево
    &screenMenuTime,  // вверх
    &screenMenuAlarm, // вниз
    &screenMain1,

    &screenMain1, // кнопка set

    selectMenuDate,   // Краткое нажатие средней кнопки
    midStub,          // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    3,
    {&textMenuTime, &textMenuDateSel, &textMenuAlr}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuAlarm =
{
    stateMenuAlarm,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuAlr0,      // Право
    &screenMenuAlarm,     // Лево
    &screenMenuDate,      // вверх
    &screenMenuBrightness,// вниз
    &screenMain1,

    &screenMain1, // кнопка set

    midStub,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    3,
    {&textMenuTime, &textMenuDate, &textMenuAlrSel}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuBrightness =
{
    stateMenuBrightness,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuBrightness,  // Право
    &screenMenuBrightness,  // Лево
    &screenMenuAlarm,       // вверх
    &screenMenuDebug,  // вниз
    &screenMain1,       //Долгое нажатие влево

    &screenMain1, // кнопка set

    inBrightness,      // Краткое нажатие средней кнопки
    midStub,           // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    2,
    {&textMenuBrightSel, &textMenuDebug}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuPomidoro =
{
    stateMenuBrightness,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuPomidoroWork,  // Право
    &screenMenuPomidoro,      // Лево
    &screenMenuBrightness,    // вверх
    &screenMenuDebug,         // вниз
    &screenMain1,             //Долгое нажатие влево

    &screenMain1,       // кнопка set

    inBrightness,       // Краткое нажатие средней кнопки
    midStub,            // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    2,
    {&textMenuBrightSel, &textMenuDebug}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuDebug =
{
    stateMenuDebug,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuDebugAHT10,      // Право
    &screenMenuDebug,      // Лево
    &screenMenuBrightness, // вверх
    &screenMenuDebug,      // вниз
    &screenMain1,          //Долгое нажатие влево

    &screenMain1, // кнопка set

    midStub,           // Краткое нажатие средней кнопки
    midStub,           // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    2,
    {&textMenuBright, &textMenuDebugSel}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuAlr0 =
{
    stateMenuAlarm1,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuAlr0,    // Право
    &screenMenuAlarm,   // Лево
    &screenMenuAlr0,    // вверх
    &screenMenuAlr1,    // вниз
    &screenMenuAlarm,

    &screenMain1, // кнопка set

    selectMenuAlarm,      // Краткое нажатие средней кнопки
    midStub,     // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuAlr1 =
{
    stateMenuAlarm2,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuAlr1,    // Право
    &screenMenuAlarm,   // Лево
    &screenMenuAlr0,    // вверх
    &screenMenuAlr2,    // вниз
    &screenMenuAlarm,

    &screenMain1, // кнопка set

    selectMenuAlarm,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuAlr2 =
{
    stateMenuAlarm3,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuAlr2,   // Право
    &screenMenuAlarm,  // Лево
    &screenMenuAlr1,   // вверх
    &screenMenuAlr2,   // вниз
    &screenMenuAlarm,

    &screenMain1, // кнопка set

    selectMenuAlarm,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuPomidoroWork =
{
    stateMenuAlarm3,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuPomidoroWork,      // Право
    &screenMenuPomidoro,             // Лево
    &screenMenuPomidoroWork,      // вверх
    &screenMenuPomidoroSmallRest, // вниз
    &screenMenuAlarm,

    &screenMain1,       // кнопка set

    selectMenuAlarm,    // Краткое нажатие средней кнопки
    midStub,            // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuPomidoroSmallRest =
{
    stateMenuAlarm3,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuPomidoroSmallRest,   // Право
    &screenMenuPomidoro,  // Лево
    &screenMenuPomidoroWork,   // вверх
    &screenMenuPomidoroBigRest,   // вниз
    &screenMenuAlarm,

