Llerr/Clock-on-STM32/Core/Src/Screen/ScreensDescriptions.c
    &screenMain1, // кнопка set

    selectMenuAlarm,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuPomidoroBigRest =
{
    stateMenuAlarm3,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuPomidoroBigRest,   // Право
    &screenMenuPomidoro,  // Лево
    &screenMenuPomidoroSmallRest,   // вверх
    &screenMenuPomidorosNum,   // вниз
    &screenMenuAlarm,

    &screenMain1, // кнопка set

    selectMenuAlarm,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuPomidorosNum =
{
    stateMenuAlarm3,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuPomidorosNum,   // Право
    &screenMenuPomidoro,  // Лево
    &screenMenuPomidoroBigRest,   // вверх
    &screenMenuPomidorosSeries,   // вниз
    &screenMenuAlarm,

    &screenMain1, // кнопка set

    selectMenuAlarm,    // Краткое нажатие средней кнопки
    midStub,            // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuPomidorosSeries =
{
    stateMenuAlarm3,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuPomidorosSeries, // Право
    &screenMenuPomidoro,        // Лево
    &screenMenuPomidorosNum,    // вверх
    &screenMenuPomidorosSeries, // вниз
    &screenMenuAlarm,

    &screenMain1, // кнопка set

    selectMenuAlarm,    // Краткое нажатие средней кнопки
    midStub,            // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuDebugAHT10 =
{
    stateMenuDebug,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuDebugAHT10,  // Право
    &screenMenuDebug,       // Лево
    &screenMenuDebugAHT10,  // вверх
    &screenMenuDebugBMP280,      // вниз
    &screenMain1,          //Долгое нажатие влево

    &screenMain1, // кнопка set

    midStub,           // Краткое нажатие средней кнопки
    midStub,           // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    1,
    {&textDebugAHT10}
};

//----------------------------------------- 0-----------------------------------------------------------------------------
ScreenDescript screenMenuDebugBMP280 =
{
    stateMenuDebug,
    NULL, //blink
    1,               //автосброс режима

    &screenMenuDebugBMP280,  // Право
    &screenMenuDebug,        // Лево
    &screenMenuDebugAHT10,   // вверх
    &screenMenuDebugBMP280,  // вниз
    &screenMain1,            //Долгое нажатие влево

    &screenMain1, // кнопка set

    midStub,      // Краткое нажатие средней кнопки
    midStub,           // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    1,
    {&textDebugBMP280}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenEditTime =
{
    stateTimeEdit,
    &textBlinkTimeEdit, //blink
    0,               //автосброс режима

    &screenEditTime,   // Право
    &screenEditTime,   // Лево
    &screenEditTime,   // вверх
    &screenEditTime,   // вниз
    &screenMenuTime,

    &screenEditTime, // кнопка set (В режиме редактирования не используется)

    saveTime,      // Краткое нажатие средней кнопки
    midStub,        // Долгое нажатие средней кнопки
    buttonReceiverTimeEdit, // Обработчик кнопок в этом пункте
    1,
    {&textTimeEdit}
};


//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenEditAlarm =
{
    stateAlarmEdit,
    &textBlinkTimeEdit, //blink
    0,               //автосброс режима

    &screenEditAlarm,    // Право
    &screenEditAlarm,    // Лево
    &screenEditAlarm,    // вверх
    &screenEditAlarm,    // вниз
    &screenMenuAlr0,

    &screenEditAlarm, // кнопка set (В режиме редактирования не используется)

    saveAlarm,      // Краткое нажатие средней кнопки
    midStub,        // Долгое нажатие средней кнопки
    buttonReceiverAlarmEdit, // Обработчик кнопок в этом пункте
    4,
    {&textTimeEdit, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenEditDate =
{
    stateDateEdtit,
    &textBlink32, //blink
    0,               //автосброс режима

    &screenEditDate,  // Право
    &screenEditDate,  // Лево
    &screenEditDate,  // вверх
    &screenEditDate,  // вниз
    &screenMenuTime,

    &screenMenuTime, // кнопка set

    saveDate,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverDateEdit, // Обработчик кнопок в этом пункте
    1,
    {&textEdit32}
};

